<script setup>
  import TestContainer from "@/components/TestContainer.vue";
  import CustomInput from "@/components/CustomInput.vue";

  import { provide } from 'vue';
  import {computed, ref} from "vue";
  import FormLogin from "@/components/FormLogin.vue";

  const input = ref('')
  const inputError = computed(()=>{
      return input.value.trim().length ? "" : "Input is required"
  })

  const helperText = computed(()=>{
    return "A smile always expresses positive emotions: happiness, joy, fun. Smile at someone and they'll smile back :)"
  });

  import KyivGerb from './assets/img/gerbs-Kyiv.png'
  import KharkivGerb from './assets/img/gerbs-Kharkiv.png'
  import VinnytsyaGerb from './assets/img/gerbs-Vinnytsya.png'
  import ZakarpattiaGerb from './assets/img/gerbs-Zakarpattia.png'
  import ZaporizhiaGerb from './assets/img/gerbs-Zaporizhia.png'

  const arrCities = [{
      id: 1,
      name: "Kyiv",
      src: KyivGerb,
      description: "Київ – це старовинне місто, розташоване на берегах річки Дніпро в Україні. Заснований близько 1500 років тому, Київ багатий на історію та культурну спадщину. Він вражає своєю архітектурою, зокрема святинями, які включають в себе Софійський собор і Києво-Печерську лавру. Місто також славиться музеями, галереями і театрами. Київ – це сучасний мегаполіс з великою кількістю ресторанів, кафе і нічних клубів, а також парками та скверами, які надають можливість насолоджуватися природою. Місто завжди живе і пульсує життям, об'єднуючи минуле і сучасність в одному неймовірному місці.",
    },
    {
      id: 2,
      name: "Kharkiv",
      src: KharkivGerb,
      description: "Харків – це велике місто, розташоване в північно-східній частині України. Місто славиться своєю історією, культурною спадщиною та інтелектуальним доробком. Харків має багатий архітектурний ландшафт, де виділяються історичні пам'ятки, парки і сучасні споруди. Місто є важливим освітнім і науковим центром, де розташовані численні університети та наукові інститути. Тут проводяться культурні події, фестивалі, виставки та спортивні змагання.  Харків також славиться своєю гостинністю та кулінарними традиціями, пропонуючи різноманітні страви у місцевих ресторанах і кафе. Місто Харків має свій унікальний характер і пропонує багато можливостей для відвідувачів та мешканців.",
    },
    {
      id: 3,
      name: "Vinnytsya",
      src: VinnytsyaGerb,
      description: "Вінниця - це затишне місто в Україні, яке розташоване на південному заході країни. Місто вражає своєю природною красою та історичним спадком. Він славиться мальовничими парками, зеленими алеями і спокійними вулицями. Відвідувачі можуть насолоджуватися чарівними краєвидами на берегах річки Пдолисся та відвідувати історичні пам'ятки, такі як Вінницька катедра і будівлі в стилі ар-нуво. Вінниця також відома своєю гостинністю та смачною українською кухнею. Місто пропонує багато можливостей для культурного відпочинку, включаючи музеї, театри та фестивалі. Віниця - це місце, де сучасність зливається з багатою історією, створюючи особливу атмосферу.",
    },
    {
      id: 4,
      name: "Zakarpattia",
      src: ZakarpattiaGerb,
      description: "Закарпаття - це чудовий регіон в заходній частині України, який кордонить з Польщею, Словаччиною та Угорщиною. Регіон вражає своєю природною красою, гірськими ландшафтами, численними річками та озерами.Гірські хребти Карпати простягаються через Закарпаття і пропонують відмінні умови для туризму та активного відпочинку. Тут можна знайти чарівні гірські курорти, які відомі своєю чистою природою та можливістю катання на лижах взимку.Закарпаття також славиться своєю унікальною культурною спадщиною, де зустрічається вплив різних національностей, таких як українці, угорці, румуни та інші. Тут можна спробувати різноманітні страви і знайти велику кількість місць для відвідування, включаючи церкви з дерев'яною архітектурою і музеї з мистецтва та історією регіону. Закарпаття - це місце, де природа та культура поєднуються, створюючи неперевершену атмосферу.",
    },
    {
      id: 5,
      name: "Zaporizhia",
      src: ZaporizhiaGerb,
      description: "Запоріжжя - велике місто в Україні, розташоване на берегах річки Дніпро. Місто славиться своєю промисловістю та важливим господарським значенням. Воно є одним із найбільших економічних центрів країни. Запоріжжя має багатий культурний спадок, включаючи театри, музеї і художні галереї. Однією з визначних архітектурних споруд є Дніпрогес - гідроелектростанція, яка була побудована в 1930-х роках. Місто також славиться своєю природною красою, зокрема парками та набережними, де можна насолоджуватися релаксом біля води. Запоріжжя - це місто, де поєднуються промисловість, культура та природа, створюючи унікальну атмосферу.",
    },
  ];
  provide('cities', arrCities);

</script>

<template>
   <div id="root" class="container ">
     <form-login></form-login>
     <br>
     <custom-input type="text" label="Input title" :error="inputError" :helperText="helperText"/>
     <div class="grid gap-8">
       <TestContainer :arrColors="arrColors" />
       <TestContainer :arrColors="arrColors" />
       <TestContainer :arrColors="arrColors" />
       <TestContainer :arrColors="arrColors" />
     </div>
   </div>
</template>

<style lang="scss">
  @import './assets/css/style.scss';
</style>
